# Mask R-CNN with Inception Resnet v2 (no atrous)
# Sync-trained on COCO (with 8 GPUs) with batch size 16 (1024x1024 resolution)
# Initialized from Imagenet classification checkpoint
# TF2-Compatible, *Not* TPU-Compatible
#
# Achieves XXX mAP on COCO

model {
  faster_rcnn {
    number_of_stages: 3
    num_classes: 1
    image_resizer {
      fixed_shape_resizer {
        height: 1024
        width: 1024
      }
    }
    feature_extractor {
      type: 'faster_rcnn_inception_resnet_v2_keras'
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 17
    maxpool_kernel_size: 1
    maxpool_stride: 1
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        mask_height: 33
        mask_width: 33
        mask_prediction_conv_depth: 0
        mask_prediction_num_conv_layers: 4
        conv_hyperparams {
          op: CONV
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.01
            }
          }
        }
        predict_instance_masks: true
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 200
        max_total_detections: 200
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
    second_stage_mask_prediction_loss_weight: 4.0
  }
}

######################
# Modified for non-gpu training

train_config: {
  batch_size: 1
  num_steps: 20000
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        cosine_decay_learning_rate {
          learning_rate_base: 0.0001
          total_steps: 20000
          warmup_learning_rate: 0.0
          warmup_steps: 2000
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/Users/wronk/Data/divot_detect/mask_rcnn_inception_resnet_v2_1024x1024_coco17_gpu-8/checkpoint/ckpt-0"
  fine_tune_checkpoint_type: "detection"
  #fine_tune_checkpoint: "/Users/wronk/Data/divot_detect/mask_rcnn_inception_resnet_v2_atrous_coco_2018_01_28/model.ckpt"
  #fine_tune_checkpoint_type: "classification"
  fine_tune_checkpoint_version: V2  # Required if using TF2 checkpoints
  #keep_checkpoint_every_n_hours: 0.5
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
    }
  }
  data_augmentation_options {
    random_rotation90 {
    }
  }
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "/Users/wronk/Data/divot_detect/craters_sample/craters_*_20201210.record"
  }
  label_map_path: "/Users/wronk/Builds/divdet/model_dev/labels/crater_label_map.pbtxt"
  load_instance_masks: true
  mask_type: PNG_MASKS
  shuffle_buffer_size: 1
  max_number_of_boxes: 1000
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  metrics_set: "coco_mask_metrics"
  eval_instance_masks: true
  use_moving_averages: false
  batch_size: 1
  eval_interval_secs: 300
  num_visualizations: 20
  visualization_export_dir: "visualizations"
  max_num_boxes_to_visualize: 1000
  skip_labels: true
  #include_metrics_per_category: true
}
eval_input_reader: {
  tf_record_input_reader {
    input_path: "/Users/wronk/Data/divot_detect/craters_sample/craters_moon_20201210.record"
  }
  label_map_path: "/Users/wronk/Builds/divdet/model_dev/labels/crater_label_map.pbtxt"
  name: "training_data_moon"
  num_epochs: 1
  load_instance_masks: true
  mask_type: PNG_MASKS
  shuffle: false
  max_number_of_boxes: 1000
}
eval_input_reader: {
  tf_record_input_reader {
    input_path: "/Users/wronk/Data/divot_detect/craters_sample/craters_mars_20201210.record"
  }
  label_map_path: "/Users/wronk/Builds/divdet/model_dev/labels/crater_label_map.pbtxt"
  name: "training_data_mars"
  num_epochs: 1
  load_instance_masks: true
  mask_type: PNG_MASKS
  shuffle: false
  max_number_of_boxes: 1000
}
